app/controllers/soups_controller.rb

SELECT  "soups".* FROM "soups"  WHERE "soups"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @soup = Soup.find(params[:id])