app/controllers/soups_controller.rb

SELECT "soups".* FROM "soups"
---
  def index
    @soups = Soup.all

UPDATE "soups" SET "featured" = ?, "updated_at" = ? WHERE "soups"."id" = 2  [["featured", "f"], ["updated_at", "2014-08-18 18:05:36.130282"]]
---
  def toggle_featured
    @soup.toggle!(:featured)