app/views/categories/show.html.erb

SELECT "soups".* FROM "soups"  WHERE "soups"."category_id" = ?  [["category_id", 1]]
---
<ul>
  <% @category.soups.each do |soup| %>